Revit 2025 API
Rebar.GetCenterlineCurves Method
 A chain of curves representing the centerline of the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public IList<Curve> GetCenterlineCurves(
	bool adjustForSelfIntersection,
	bool suppressHooks,
	bool suppressBendRadius,
	MultiplanarOption multiplanarOption,
	int barPositionIndex
)
Public Function GetCenterlineCurves (
	adjustForSelfIntersection As Boolean,
	suppressHooks As Boolean,
	suppressBendRadius As Boolean,
	multiplanarOption As MultiplanarOption,
	barPositionIndex As Integer
) As IList(Of Curve)
public:
IList<Curve^>^ GetCenterlineCurves(
	bool adjustForSelfIntersection,
	bool suppressHooks,
	bool suppressBendRadius,
	MultiplanarOption multiplanarOption,
	int barPositionIndex
)
member GetCenterlineCurves :
        adjustForSelfIntersection : bool *
        suppressHooks : bool *
        suppressBendRadius : bool *
        multiplanarOption : MultiplanarOption *
        barPositionIndex : int -> IList<Curve>
Parameters
adjustForSelfIntersection Boolean
 If the curves overlap, as in a planar stirrup, this parameter controls whether they should be adjusted to avoid intersection (as in fine views), or kept in a single plane for simplicity (as in coarse views).
suppressHooks Boolean
 Identifies if the chain will include hooks curves.
suppressBendRadius Boolean
 Identifies if the connected chain will include unfilleted curves.
multiplanarOption MultiplanarOption
 If the Rebar is a multi-planar shape, this parameter controls whether to generate only the curves in the primary plane (IncludeOnlyPlanarCurves), or to generate all curves, (IncludeAllMultiplanarCurves) including the out-of-plane connector segments as well as multi-planar copies of the primary plane curves. This argument is ignored for planar shapes.
barPositionIndex Int32
 An index between 0 and (NumberOfBarPositions-1). Use the barPositionIndex to obtain all the curves at a specific index in the distribution. You can use GetNumberOfBarPositions() to verify if a specific rebar has more than one bar positions. This is useful for rebar sets that have varying length bars. In this case you can retrieve the centerline curve geometry of that particular bar, by passing the appropriate index If the rebar set don't have varying bars, the form of the bars does not vary from one index to another.
Return Value
IList<Curve>
 The centerline curves or empty array if the curves cannot be computed because the parameters values are inconsistent with the constraints of the RebarShape definition.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ]. -or- A value passed for an enumeration argument is not a member of that enumeration
Remarks
 This method will return the centerline curves for bar at barPositionIndex even if this bar isn't included.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace